---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.PathReinforcement
source: html/90dd1090-bf0a-c281-cbb1-62414bca7852.htm
---
# PathReinforcement Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.